app/views/messages/_index.html.slim

        = label_tag :users, t('label.recipients')
        = text_field_tag :users, User.all.map(&:id).join(','), :class => 'string required'
---
SELECT `users`.* FROM `users`