app/views/users/_venues.html.erb

  <div class = "dashboard_grid_medium">
    <% if @user.venues.any? %>
---
SELECT COUNT(*) FROM `venues` WHERE `venues`.`user_id` = 2