app/controllers/users_controller.rb

  def show
  	@user = current_user
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1 OFFSET 0