app/controllers/venues_controller.rb

SELECT `venues`.* FROM `venues`
---
  def index
    @venues = Venue.all

SELECT `venues`.* FROM `venues` WHERE `venues`.`id` = 1 LIMIT 1
---
  def show
    if params[:url]
      @venue = Venue.find_by_url(params[:url])
      if !@venue
	redirect_to venues_path
	return
      end
    elsif params[:id]
      @venue = Venue.find(params[:id])

INSERT INTO `venues` (`address`, `city`, `company_name`, `created_at`, `phone`, `state`, `updated_at`, `user_id`, `website`, `zip`) VALUES ('3182 Mission St', 'San Francisco', 'Venue Scout Inc, Event Studio', '2012-02-24 19:41:22', NULL, 'CA', '2012-02-24 19:41:22', 1, NULL, '94110')
---
  def create
    @venue = current_user.venues.build(params[:venue])

    respond_to do |format|
      if @venue.save